/*
 * Copyright (C) 2024 Huawei Device Co., Ltd.
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* automatically generated by rust-bindgen 0.70.1 */

pub const _BSD_SOURCE: u32 = 1;
pub const _XOPEN_SOURCE: u32 = 700;
pub const __BYTE_ORDER: u32 = 1234;
pub const __LONG_MAX: u64 = 9223372036854775807;
pub const __LITTLE_ENDIAN: u32 = 1234;
pub const __BIG_ENDIAN: u32 = 4321;
pub const __USE_TIME_BITS64: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT64_MIN: i64 = -9223372036854775808;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const INT64_MAX: u64 = 9223372036854775807;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const UINT64_MAX: i32 = -1;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST64_MIN: i64 = -9223372036854775808;

pub const UDMF_META_SPREADSHEETML_SHEET: &[u8; 39] = b"org.openxmlformats.spreadsheetml.sheet\0";
pub const UDMF_META_PRESENTATIONML_PRESENTATION: &[u8; 47] =
    b"org.openxmlformats.presentationml.presentation\0";
pub const UDMF_META_OPENDOCUMENT: &[u8; 23] = b"org.oasis.opendocument\0";
pub const UDMF_META_OPENDOCUMENT_TEXT: &[u8; 28] = b"org.oasis.opendocument.text\0";
pub const UDMF_META_OPENDOCUMENT_SPREADSHEET: &[u8; 35] = b"org.oasis.opendocument.spreadsheet\0";
pub const UDMF_META_OPENDOCUMENT_PRESENTATION: &[u8; 36] = b"org.oasis.opendocument.presentation\0";
pub const UDMF_META_OPENDOCUMENT_GRAPHICS: &[u8; 32] = b"org.oasis.opendocument.graphics\0";
pub const UDMF_META_OPENDOCUMENT_FORMULA: &[u8; 31] = b"org.oasis.opendocument.formula\0";
pub const UDMF_META_STUFFIT_ARCHIVE: &[u8; 27] = b"com.allume.stuffit-archive\0";
pub const UDMF_META_VCS: &[u8; 12] = b"general.vcs\0";
pub const UDMF_META_ICS: &[u8; 12] = b"general.ics\0";
pub const UDMF_META_EXECUTABLE: &[u8; 19] = b"general.executable\0";
pub const UDMF_META_PORTABLE_EXECUTABLE: &[u8; 34] = b"com.microsoft.portable-executable\0";
pub const UDMF_META_SUN_JAVA_CLASS: &[u8; 19] = b"com.sun.java-class\0";
pub const UDMF_META_FONT: &[u8; 13] = b"general.font\0";
pub const UDMF_META_TRUETYPE_FONT: &[u8; 22] = b"general.truetype-font\0";
pub const UDMF_META_TRUETYPE_COLLECTION_FONT: &[u8; 33] = b"general.truetype-collection-font\0";
pub const UDMF_META_OPENTYPE_FONT: &[u8; 22] = b"general.opentype-font\0";
pub const UDMF_META_POSTSCRIPT_FONT: &[u8; 26] = b"com.adobe.postscript-font\0";
pub const UDMF_META_POSTSCRIPT_PFB_FONT: &[u8; 30] = b"com.adobe.postscript-pfb-font\0";
pub const UDMF_META_POSTSCRIPT_PFA_FONT: &[u8; 30] = b"com.adobe.postscript-pfa-font\0";
pub const UDMF_META_OPENHARMONY_HDOC: &[u8; 17] = b"openharmony.hdoc\0";
pub const UDMF_META_OPENHARMONY_HINOTE: &[u8; 19] = b"openharmony.hinote\0";
pub const UDMF_META_OPENHARMONY_STYLED_STRING: &[u8; 26] = b"openharmony.styled-string\0";
pub const UDMF_META_OPENHARMONY_WANT: &[u8; 17] = b"openharmony.want\0";
pub const UDMF_META_GENERAL_FILE_URI: &[u8; 17] = b"general.file-uri\0";
pub const UDMF_METE_GENERAL_CONTENT_FORM: &[u8; 21] = b"general.content-form\0";
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = i8;
pub type int_fast64_t = i64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast64_t = u64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast16_t = i32;
pub type int_fast32_t = i32;
pub type uint_fast16_t = u32;
pub type uint_fast32_t = u32;
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
extern "C" {
    pub fn imaxabs(arg1: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(arg1: intmax_t, arg2: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Image_Size {
    pub width: u32,
    pub height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Image_Size"][::std::mem::size_of::<Image_Size>() - 8usize];
    ["Alignment of Image_Size"][::std::mem::align_of::<Image_Size>() - 4usize];
    ["Offset of field: Image_Size::width"][::std::mem::offset_of!(Image_Size, width) - 0usize];
    ["Offset of field: Image_Size::height"][::std::mem::offset_of!(Image_Size, height) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Image_Region {
    pub x: u32,
    pub y: u32,
    pub width: u32,
    pub height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Image_Region"][::std::mem::size_of::<Image_Region>() - 16usize];
    ["Alignment of Image_Region"][::std::mem::align_of::<Image_Region>() - 4usize];
    ["Offset of field: Image_Region::x"][::std::mem::offset_of!(Image_Region, x) - 0usize];
    ["Offset of field: Image_Region::y"][::std::mem::offset_of!(Image_Region, y) - 4usize];
    ["Offset of field: Image_Region::width"][::std::mem::offset_of!(Image_Region, width) - 8usize];
    ["Offset of field: Image_Region::height"]
        [::std::mem::offset_of!(Image_Region, height) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Image_String {
    pub data: *mut ::std::os::raw::c_char,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Image_String"][::std::mem::size_of::<Image_String>() - 16usize];
    ["Alignment of Image_String"][::std::mem::align_of::<Image_String>() - 8usize];
    ["Offset of field: Image_String::data"][::std::mem::offset_of!(Image_String, data) - 0usize];
    ["Offset of field: Image_String::size"][::std::mem::offset_of!(Image_String, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_PictureMetadata {
    _unused: [u8; 0],
}
pub type Image_MimeType = Image_String;
pub const Image_ErrorCode_IMAGE_SUCCESS: Image_ErrorCode = 0;
pub const Image_ErrorCode_IMAGE_BAD_PARAMETER: Image_ErrorCode = 401;
pub const Image_ErrorCode_IMAGE_UNSUPPORTED_MIME_TYPE: Image_ErrorCode = 7600101;
pub const Image_ErrorCode_IMAGE_UNKNOWN_MIME_TYPE: Image_ErrorCode = 7600102;
pub const Image_ErrorCode_IMAGE_TOO_LARGE: Image_ErrorCode = 7600103;
pub const Image_ErrorCode_IMAGE_DMA_NOT_EXIST: Image_ErrorCode = 7600173;
pub const Image_ErrorCode_IMAGE_DMA_OPERATION_FAILED: Image_ErrorCode = 7600174;
pub const Image_ErrorCode_IMAGE_UNSUPPORTED_OPERATION: Image_ErrorCode = 7600201;
pub const Image_ErrorCode_IMAGE_UNSUPPORTED_METADATA: Image_ErrorCode = 7600202;
pub const Image_ErrorCode_IMAGE_UNSUPPORTED_CONVERSION: Image_ErrorCode = 7600203;
pub const Image_ErrorCode_IMAGE_INVALID_REGION: Image_ErrorCode = 7600204;
pub const Image_ErrorCode_IMAGE_UNSUPPORTED_MEMORY_FORMAT: Image_ErrorCode = 7600205;
pub const Image_ErrorCode_IMAGE_ALLOC_FAILED: Image_ErrorCode = 7600301;
pub const Image_ErrorCode_IMAGE_COPY_FAILED: Image_ErrorCode = 7600302;
pub const Image_ErrorCode_IMAGE_UNKNOWN_ERROR: Image_ErrorCode = 7600901;
pub const Image_ErrorCode_IMAGE_BAD_SOURCE: Image_ErrorCode = 7700101;
pub const Image_ErrorCode_IMAGE_DECODE_FAILED: Image_ErrorCode = 7700301;
pub const Image_ErrorCode_IMAGE_ENCODE_FAILED: Image_ErrorCode = 7800301;
pub type Image_ErrorCode = ::std::os::raw::c_uint;
pub const Image_MetadataType_EXIF_METADATA: Image_MetadataType = 1;
pub const Image_MetadataType_FRAGMENT_METADATA: Image_MetadataType = 2;
pub type Image_MetadataType = ::std::os::raw::c_uint;
extern "C" {
    pub fn OH_PictureMetadata_Create(
        metadataType: Image_MetadataType,
        metadata: *mut *mut OH_PictureMetadata,
    ) -> Image_ErrorCode;
}
extern "C" {
    pub fn OH_PictureMetadata_GetProperty(
        metadata: *mut OH_PictureMetadata,
        key: *mut Image_String,
        value: *mut Image_String,
    ) -> Image_ErrorCode;
}
extern "C" {
    pub fn OH_PictureMetadata_SetProperty(
        metadata: *mut OH_PictureMetadata,
        key: *mut Image_String,
        value: *mut Image_String,
    ) -> Image_ErrorCode;
}
extern "C" {
    pub fn OH_PictureMetadata_Release(metadata: *mut OH_PictureMetadata) -> Image_ErrorCode;
}
extern "C" {
    pub fn OH_PictureMetadata_Clone(
        oldMetadata: *mut OH_PictureMetadata,
        newMetadata: *mut *mut OH_PictureMetadata,
    ) -> Image_ErrorCode;
}
pub const MIME_TYPE_BMP: &[u8; 10] = b"image/bmp\0";
pub const MIME_TYPE_JPEG: &[u8; 11] = b"image/jpeg\0";
pub const MIME_TYPE_HEIC: &[u8; 11] = b"image/heic\0";
pub const MIME_TYPE_PNG: &[u8; 10] = b"image/png\0";
pub const MIME_TYPE_WEBP: &[u8; 11] = b"image/webp\0";
pub const MIME_TYPE_GIF: &[u8; 10] = b"image/gif\0";
pub const MIME_TYPE_ICON: &[u8; 13] = b"image/x-icon\0";
pub const OHOS_IMAGE_PROPERTY_BITS_PER_SAMPLE: &[u8; 14] = b"BitsPerSample\0";
pub const OHOS_IMAGE_PROPERTY_ORIENTATION: &[u8; 12] = b"Orientation\0";
pub const OHOS_IMAGE_PROPERTY_IMAGE_LENGTH: &[u8; 12] = b"ImageLength\0";
pub const OHOS_IMAGE_PROPERTY_IMAGE_WIDTH: &[u8; 11] = b"ImageWidth\0";
pub const OHOS_IMAGE_PROPERTY_GPS_LATITUDE: &[u8; 12] = b"GPSLatitude\0";
pub const OHOS_IMAGE_PROPERTY_GPS_LONGITUDE: &[u8; 13] = b"GPSLongitude\0";
pub const OHOS_IMAGE_PROPERTY_GPS_LATITUDE_REF: &[u8; 15] = b"GPSLatitudeRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_LONGITUDE_REF: &[u8; 16] = b"GPSLongitudeRef\0";
pub const OHOS_IMAGE_PROPERTY_DATE_TIME_ORIGINAL: &[u8; 17] = b"DateTimeOriginal\0";
pub const OHOS_IMAGE_PROPERTY_EXPOSURE_TIME: &[u8; 13] = b"ExposureTime\0";
pub const OHOS_IMAGE_PROPERTY_SCENE_TYPE: &[u8; 10] = b"SceneType\0";
pub const OHOS_IMAGE_PROPERTY_ISO_SPEED_RATINGS: &[u8; 16] = b"ISOSpeedRatings\0";
pub const OHOS_IMAGE_PROPERTY_F_NUMBER: &[u8; 8] = b"FNumber\0";
pub const OHOS_IMAGE_PROPERTY_COMPRESSED_BITS_PER_PIXEL: &[u8; 23] = b"CompressedBitsPerPixel\0";
pub const OHOS_IMAGE_PROPERTY_COMPRESSION: &[u8; 12] = b"Compression\0";
pub const OHOS_IMAGE_PROPERTY_PHOTOMETRIC_INTERPRETATION: &[u8; 26] =
    b"PhotometricInterpretation\0";
pub const OHOS_IMAGE_PROPERTY_STRIP_OFFSETS: &[u8; 13] = b"StripOffsets\0";
pub const OHOS_IMAGE_PROPERTY_SAMPLES_PER_PIXEL: &[u8; 16] = b"SamplesPerPixel\0";
pub const OHOS_IMAGE_PROPERTY_ROWS_PER_STRIP: &[u8; 13] = b"RowsPerStrip\0";
pub const OHOS_IMAGE_PROPERTY_STRIP_BYTE_COUNTS: &[u8; 16] = b"StripByteCounts\0";
pub const OHOS_IMAGE_PROPERTY_X_RESOLUTION: &[u8; 12] = b"XResolution\0";
pub const OHOS_IMAGE_PROPERTY_Y_RESOLUTION: &[u8; 12] = b"YResolution\0";
pub const OHOS_IMAGE_PROPERTY_PLANAR_CONFIGURATION: &[u8; 20] = b"PlanarConfiguration\0";
pub const OHOS_IMAGE_PROPERTY_RESOLUTION_UNIT: &[u8; 15] = b"ResolutionUnit\0";
pub const OHOS_IMAGE_PROPERTY_TRANSFER_FUNCTION: &[u8; 17] = b"TransferFunction\0";
pub const OHOS_IMAGE_PROPERTY_SOFTWARE: &[u8; 9] = b"Software\0";
pub const OHOS_IMAGE_PROPERTY_ARTIST: &[u8; 7] = b"Artist\0";
pub const OHOS_IMAGE_PROPERTY_WHITE_POINT: &[u8; 11] = b"WhitePoint\0";
pub const OHOS_IMAGE_PROPERTY_PRIMARY_CHROMATICITIES: &[u8; 22] = b"PrimaryChromaticities\0";
pub const OHOS_IMAGE_PROPERTY_YCBCR_COEFFICIENTS: &[u8; 18] = b"YCbCrCoefficients\0";
pub const OHOS_IMAGE_PROPERTY_YCBCR_SUB_SAMPLING: &[u8; 17] = b"YCbCrSubSampling\0";
pub const OHOS_IMAGE_PROPERTY_YCBCR_POSITIONING: &[u8; 17] = b"YCbCrPositioning\0";
pub const OHOS_IMAGE_PROPERTY_REFERENCE_BLACK_WHITE: &[u8; 20] = b"ReferenceBlackWhite\0";
pub const OHOS_IMAGE_PROPERTY_COPYRIGHT: &[u8; 10] = b"Copyright\0";
pub const OHOS_IMAGE_PROPERTY_JPEG_INTERCHANGE_FORMAT: &[u8; 22] = b"JPEGInterchangeFormat\0";
pub const OHOS_IMAGE_PROPERTY_JPEG_INTERCHANGE_FORMAT_LENGTH: &[u8; 28] =
    b"JPEGInterchangeFormatLength\0";
pub const OHOS_IMAGE_PROPERTY_EXPOSURE_PROGRAM: &[u8; 16] = b"ExposureProgram\0";
pub const OHOS_IMAGE_PROPERTY_SPECTRAL_SENSITIVITY: &[u8; 20] = b"SpectralSensitivity\0";
pub const OHOS_IMAGE_PROPERTY_OECF: &[u8; 5] = b"OECF\0";
pub const OHOS_IMAGE_PROPERTY_EXIF_VERSION: &[u8; 12] = b"ExifVersion\0";
pub const OHOS_IMAGE_PROPERTY_DATE_TIME_DIGITIZED: &[u8; 18] = b"DateTimeDigitized\0";
pub const OHOS_IMAGE_PROPERTY_COMPONENTS_CONFIGURATION: &[u8; 24] = b"ComponentsConfiguration\0";
pub const OHOS_IMAGE_PROPERTY_SHUTTER_SPEED_VALUE: &[u8; 18] = b"ShutterSpeedValue\0";
pub const OHOS_IMAGE_PROPERTY_BRIGHTNESS_VALUE: &[u8; 16] = b"BrightnessValue\0";
pub const OHOS_IMAGE_PROPERTY_MAX_APERTURE_VALUE: &[u8; 17] = b"MaxApertureValue\0";
pub const OHOS_IMAGE_PROPERTY_SUBJECT_DISTANCE: &[u8; 16] = b"SubjectDistance\0";
pub const OHOS_IMAGE_PROPERTY_SUBJECT_AREA: &[u8; 12] = b"SubjectArea\0";
pub const OHOS_IMAGE_PROPERTY_MAKER_NOTE: &[u8; 10] = b"MakerNote\0";
pub const OHOS_IMAGE_PROPERTY_SUBSEC_TIME: &[u8; 11] = b"SubsecTime\0";
pub const OHOS_IMAGE_PROPERTY_SUBSEC_TIME_ORIGINAL: &[u8; 19] = b"SubsecTimeOriginal\0";
pub const OHOS_IMAGE_PROPERTY_SUBSEC_TIME_DIGITIZED: &[u8; 20] = b"SubsecTimeDigitized\0";
pub const OHOS_IMAGE_PROPERTY_FLASHPIX_VERSION: &[u8; 16] = b"FlashpixVersion\0";
pub const OHOS_IMAGE_PROPERTY_COLOR_SPACE: &[u8; 11] = b"ColorSpace\0";
pub const OHOS_IMAGE_PROPERTY_RELATED_SOUND_FILE: &[u8; 17] = b"RelatedSoundFile\0";
pub const OHOS_IMAGE_PROPERTY_FLASH_ENERGY: &[u8; 12] = b"FlashEnergy\0";
pub const OHOS_IMAGE_PROPERTY_SPATIAL_FREQUENCY_RESPONSE: &[u8; 25] = b"SpatialFrequencyResponse\0";
pub const OHOS_IMAGE_PROPERTY_FOCAL_PLANE_X_RESOLUTION: &[u8; 22] = b"FocalPlaneXResolution\0";
pub const OHOS_IMAGE_PROPERTY_FOCAL_PLANE_Y_RESOLUTION: &[u8; 22] = b"FocalPlaneYResolution\0";
pub const OHOS_IMAGE_PROPERTY_FOCAL_PLANE_RESOLUTION_UNIT: &[u8; 25] =
    b"FocalPlaneResolutionUnit\0";
pub const OHOS_IMAGE_PROPERTY_SUBJECT_LOCATION: &[u8; 16] = b"SubjectLocation\0";
pub const OHOS_IMAGE_PROPERTY_EXPOSURE_INDEX: &[u8; 14] = b"ExposureIndex\0";
pub const OHOS_IMAGE_PROPERTY_SENSING_METHOD: &[u8; 14] = b"SensingMethod\0";
pub const OHOS_IMAGE_PROPERTY_FILE_SOURCE: &[u8; 11] = b"FileSource\0";
pub const OHOS_IMAGE_PROPERTY_CFA_PATTERN: &[u8; 11] = b"CFAPattern\0";
pub const OHOS_IMAGE_PROPERTY_CUSTOM_RENDERED: &[u8; 15] = b"CustomRendered\0";
pub const OHOS_IMAGE_PROPERTY_EXPOSURE_MODE: &[u8; 13] = b"ExposureMode\0";
pub const OHOS_IMAGE_PROPERTY_DIGITAL_ZOOM_RATIO: &[u8; 17] = b"DigitalZoomRatio\0";
pub const OHOS_IMAGE_PROPERTY_SCENE_CAPTURE_TYPE: &[u8; 17] = b"SceneCaptureType\0";
pub const OHOS_IMAGE_PROPERTY_GAIN_CONTROL: &[u8; 12] = b"GainControl\0";
pub const OHOS_IMAGE_PROPERTY_CONTRAST: &[u8; 9] = b"Contrast\0";
pub const OHOS_IMAGE_PROPERTY_SATURATION: &[u8; 11] = b"Saturation\0";
pub const OHOS_IMAGE_PROPERTY_SHARPNESS: &[u8; 10] = b"Sharpness\0";
pub const OHOS_IMAGE_PROPERTY_DEVICE_SETTING_DESCRIPTION: &[u8; 25] = b"DeviceSettingDescription\0";
pub const OHOS_IMAGE_PROPERTY_SUBJECT_DISTANCE_RANGE: &[u8; 21] = b"SubjectDistanceRange\0";
pub const OHOS_IMAGE_PROPERTY_IMAGE_UNIQUE_ID: &[u8; 14] = b"ImageUniqueID\0";
pub const OHOS_IMAGE_PROPERTY_GPS_VERSION_ID: &[u8; 13] = b"GPSVersionID\0";
pub const OHOS_IMAGE_PROPERTY_GPS_ALTITUDE_REF: &[u8; 15] = b"GPSAltitudeRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_ALTITUDE: &[u8; 12] = b"GPSAltitude\0";
pub const OHOS_IMAGE_PROPERTY_GPS_SATELLITES: &[u8; 14] = b"GPSSatellites\0";
pub const OHOS_IMAGE_PROPERTY_GPS_STATUS: &[u8; 10] = b"GPSStatus\0";
pub const OHOS_IMAGE_PROPERTY_GPS_MEASURE_MODE: &[u8; 15] = b"GPSMeasureMode\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DOP: &[u8; 7] = b"GPSDOP\0";
pub const OHOS_IMAGE_PROPERTY_GPS_SPEED_REF: &[u8; 12] = b"GPSSpeedRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_SPEED: &[u8; 9] = b"GPSSpeed\0";
pub const OHOS_IMAGE_PROPERTY_GPS_TRACK_REF: &[u8; 12] = b"GPSTrackRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_TRACK: &[u8; 9] = b"GPSTrack\0";
pub const OHOS_IMAGE_PROPERTY_GPS_IMG_DIRECTION_REF: &[u8; 19] = b"GPSImgDirectionRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_IMG_DIRECTION: &[u8; 16] = b"GPSImgDirection\0";
pub const OHOS_IMAGE_PROPERTY_GPS_MAP_DATUM: &[u8; 12] = b"GPSMapDatum\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_LATITUDE_REF: &[u8; 19] = b"GPSDestLatitudeRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_LATITUDE: &[u8; 16] = b"GPSDestLatitude\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_LONGITUDE_REF: &[u8; 20] = b"GPSDestLongitudeRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_PROCESSING_METHOD: &[u8; 20] = b"GPSProcessingMethod\0";
pub const OHOS_IMAGE_PROPERTY_GPS_AREA_INFORMATION: &[u8; 19] = b"GPSAreaInformation\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DIFFERENTIAL: &[u8; 16] = b"GPSDifferential\0";
pub const OHOS_IMAGE_PROPERTY_BODY_SERIAL_NUMBER: &[u8; 17] = b"BodySerialNumber\0";
pub const OHOS_IMAGE_PROPERTY_CAMERA_OWNER_NAME: &[u8; 16] = b"CameraOwnerName\0";
pub const OHOS_IMAGE_PROPERTY_COMPOSITE_IMAGE: &[u8; 15] = b"CompositeImage\0";
pub const OHOS_IMAGE_PROPERTY_DNG_VERSION: &[u8; 11] = b"DNGVersion\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_LONGITUDE: &[u8; 17] = b"GPSDestLongitude\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_BEARING_REF: &[u8; 18] = b"GPSDestBearingRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_BEARING: &[u8; 15] = b"GPSDestBearing\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_DISTANCE_REF: &[u8; 19] = b"GPSDestDistanceRef\0";
pub const OHOS_IMAGE_PROPERTY_GPS_DEST_DISTANCE: &[u8; 16] = b"GPSDestDistance\0";
pub const OHOS_IMAGE_PROPERTY_DEFAULT_CROP_SIZE: &[u8; 16] = b"DefaultCropSize\0";
pub const OHOS_IMAGE_PROPERTY_GAMMA: &[u8; 6] = b"Gamma\0";
pub const OHOS_IMAGE_PROPERTY_ISO_SPEED_LATITUDEYYY: &[u8; 20] = b"ISOSpeedLatitudeyyy\0";
pub const OHOS_IMAGE_PROPERTY_ISO_SPEED_LATITUDEZZZ: &[u8; 20] = b"ISOSpeedLatitudezzz\0";
pub const OHOS_IMAGE_PROPERTY_LENS_MAKE: &[u8; 9] = b"LensMake\0";
pub const OHOS_IMAGE_PROPERTY_LENS_MODEL: &[u8; 10] = b"LensModel\0";
pub const OHOS_IMAGE_PROPERTY_LENS_SERIAL_NUMBER: &[u8; 17] = b"LensSerialNumber\0";
pub const OHOS_IMAGE_PROPERTY_LENS_SPECIFICATION: &[u8; 18] = b"LensSpecification\0";
pub const OHOS_IMAGE_PROPERTY_NEW_SUBFILE_TYPE: &[u8; 15] = b"NewSubfileType\0";
pub const OHOS_IMAGE_PROPERTY_OFFSET_TIME: &[u8; 11] = b"OffsetTime\0";
pub const OHOS_IMAGE_PROPERTY_OFFSET_TIME_DIGITIZED: &[u8; 20] = b"OffsetTimeDigitized\0";
pub const OHOS_IMAGE_PROPERTY_OFFSET_TIME_ORIGINAL: &[u8; 19] = b"OffsetTimeOriginal\0";
pub const OHOS_IMAGE_PROPERTY_SOURCE_EXPOSURE_TIMES_OF_COMPOSITE_IMAGE: &[u8; 36] =
    b"SourceExposureTimesOfCompositeImage\0";
pub const OHOS_IMAGE_PROPERTY_SOURCE_IMAGE_NUMBER_OF_COMPOSITE_IMAGE: &[u8; 34] =
    b"SourceImageNumberOfCompositeImage\0";
pub const OHOS_IMAGE_PROPERTY_SUBFILE_TYPE: &[u8; 12] = b"SubfileType\0";
pub const OHOS_IMAGE_PROPERTY_GPS_H_POSITIONING_ERROR: &[u8; 21] = b"GPSHPositioningError\0";
pub const OHOS_IMAGE_PROPERTY_PHOTOGRAPHIC_SENSITIVITY: &[u8; 24] = b"PhotographicSensitivity\0";
pub const OHOS_IMAGE_PROPERTY_BURST_NUMBER: &[u8; 19] = b"HwMnoteBurstNumber\0";
pub const OHOS_IMAGE_PROPERTY_FACE_CONF: &[u8; 16] = b"HwMnoteFaceConf\0";
pub const OHOS_IMAGE_PROPERTY_FACE_LEYE_CENTER: &[u8; 22] = b"HwMnoteFaceLeyeCenter\0";
pub const OHOS_IMAGE_PROPERTY_FACE_MOUTH_CENTER: &[u8; 23] = b"HwMnoteFaceMouthCenter\0";
pub const OHOS_IMAGE_PROPERTY_FACE_POINTER: &[u8; 19] = b"HwMnoteFacePointer\0";
pub const OHOS_IMAGE_PROPERTY_FACE_RECT: &[u8; 16] = b"HwMnoteFaceRect\0";
pub const OHOS_IMAGE_PROPERTY_FACE_REYE_CENTER: &[u8; 22] = b"HwMnoteFaceReyeCenter\0";
pub const OHOS_IMAGE_PROPERTY_FACE_SMILE_SCORE: &[u8; 22] = b"HwMnoteFaceSmileScore\0";
pub const OHOS_IMAGE_PROPERTY_FACE_VERSION: &[u8; 19] = b"HwMnoteFaceVersion\0";
pub const OHOS_IMAGE_PROPERTY_FRONT_CAMERA: &[u8; 19] = b"HwMnoteFrontCamera\0";
pub const OHOS_IMAGE_PROPERTY_SCENE_POINTER: &[u8; 20] = b"HwMnoteScenePointer\0";
pub const OHOS_IMAGE_PROPERTY_SCENE_VERSION: &[u8; 20] = b"HwMnoteSceneVersion\0";
pub const OHOS_IMAGE_PROPERTY_IS_XMAGE_SUPPORTED: &[u8; 24] = b"HwMnoteIsXmageSupported\0";
pub const OHOS_IMAGE_PROPERTY_XMAGE_MODE: &[u8; 17] = b"HwMnoteXmageMode\0";
pub const OHOS_IMAGE_PROPERTY_XMAGE_LEFT: &[u8; 17] = b"HwMnoteXmageLeft\0";
pub const OHOS_IMAGE_PROPERTY_XMAGE_TOP: &[u8; 16] = b"HwMnoteXmageTop\0";
pub const OHOS_IMAGE_PROPERTY_XMAGE_RIGHT: &[u8; 18] = b"HwMnoteXmageRight\0";
pub const OHOS_IMAGE_PROPERTY_XMAGE_BOTTOM: &[u8; 19] = b"HwMnoteXmageBottom\0";
pub const OHOS_IMAGE_PROPERTY_CLOUD_ENHANCEMENT_MODE: &[u8; 28] = b"HwMnoteCloudEnhancementMode\0";
pub const OHOS_IMAGE_PROPERTY_WIND_SNAPSHOT_MODE: &[u8; 24] = b"HwMnoteWindSnapshotMode\0";
pub const OHOS_IMAGE_PROPERTY_GIF_LOOP_COUNT: &[u8; 13] = b"GIFLoopCount\0";
pub const OHOS_IMAGE_PROPERTY_X_IN_ORIGINAL: &[u8; 12] = b"XInOriginal\0";
pub const OHOS_IMAGE_PROPERTY_Y_IN_ORIGINAL: &[u8; 12] = b"YInOriginal\0";
pub const OHOS_IMAGE_PROPERTY_FRAGMENT_WIDTH: &[u8; 19] = b"FragmentImageWidth\0";
pub const OHOS_IMAGE_PROPERTY_FRAGMENT_HEIGHT: &[u8; 20] = b"FragmentImageHeight\0";
pub const napi_qos_t_napi_qos_background: napi_qos_t = 0;
pub const napi_qos_t_napi_qos_utility: napi_qos_t = 1;
pub const napi_qos_t_napi_qos_default: napi_qos_t = 2;
pub const napi_qos_t_napi_qos_user_initiated: napi_qos_t = 3;
pub type napi_qos_t = ::std::os::raw::c_uint;
pub const napi_event_mode_napi_event_mode_default: napi_event_mode = 0;
pub const napi_event_mode_napi_event_mode_nowait: napi_event_mode = 1;
pub type napi_event_mode = ::std::os::raw::c_uint;
pub const napi_task_priority_napi_priority_immediate: napi_task_priority = 0;
pub const napi_task_priority_napi_priority_high: napi_task_priority = 1;
pub const napi_task_priority_napi_priority_low: napi_task_priority = 2;
pub const napi_task_priority_napi_priority_idle: napi_task_priority = 3;
pub type napi_task_priority = ::std::os::raw::c_uint;
pub type char16_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_env__ {
    _unused: [u8; 0],
}
pub type napi_env = *mut napi_env__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_value__ {
    _unused: [u8; 0],
}
pub type napi_value = *mut napi_value__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_ref__ {
    _unused: [u8; 0],
}
pub type napi_ref = *mut napi_ref__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_handle_scope__ {
    _unused: [u8; 0],
}
pub type napi_handle_scope = *mut napi_handle_scope__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_escapable_handle_scope__ {
    _unused: [u8; 0],
}
pub type napi_escapable_handle_scope = *mut napi_escapable_handle_scope__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_callback_info__ {
    _unused: [u8; 0],
}
pub type napi_callback_info = *mut napi_callback_info__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_deferred__ {
    _unused: [u8; 0],
}
pub type napi_deferred = *mut napi_deferred__;
pub const napi_property_attributes_napi_default: napi_property_attributes = 0;
pub const napi_property_attributes_napi_writable: napi_property_attributes = 1;
pub const napi_property_attributes_napi_enumerable: napi_property_attributes = 2;
pub const napi_property_attributes_napi_configurable: napi_property_attributes = 4;
pub const napi_property_attributes_napi_static: napi_property_attributes = 1024;
pub const napi_property_attributes_napi_default_method: napi_property_attributes = 5;
pub const napi_property_attributes_napi_default_jsproperty: napi_property_attributes = 7;
pub type napi_property_attributes = ::std::os::raw::c_uint;
pub const napi_valuetype_napi_undefined: napi_valuetype = 0;
pub const napi_valuetype_napi_null: napi_valuetype = 1;
pub const napi_valuetype_napi_boolean: napi_valuetype = 2;
pub const napi_valuetype_napi_number: napi_valuetype = 3;
pub const napi_valuetype_napi_string: napi_valuetype = 4;
pub const napi_valuetype_napi_symbol: napi_valuetype = 5;
pub const napi_valuetype_napi_object: napi_valuetype = 6;
pub const napi_valuetype_napi_function: napi_valuetype = 7;
pub const napi_valuetype_napi_external: napi_valuetype = 8;
pub const napi_valuetype_napi_bigint: napi_valuetype = 9;
pub type napi_valuetype = ::std::os::raw::c_uint;
pub const napi_typedarray_type_napi_int8_array: napi_typedarray_type = 0;
pub const napi_typedarray_type_napi_uint8_array: napi_typedarray_type = 1;
pub const napi_typedarray_type_napi_uint8_clamped_array: napi_typedarray_type = 2;
pub const napi_typedarray_type_napi_int16_array: napi_typedarray_type = 3;
pub const napi_typedarray_type_napi_uint16_array: napi_typedarray_type = 4;
pub const napi_typedarray_type_napi_int32_array: napi_typedarray_type = 5;
pub const napi_typedarray_type_napi_uint32_array: napi_typedarray_type = 6;
pub const napi_typedarray_type_napi_float32_array: napi_typedarray_type = 7;
pub const napi_typedarray_type_napi_float64_array: napi_typedarray_type = 8;
pub const napi_typedarray_type_napi_bigint64_array: napi_typedarray_type = 9;
pub const napi_typedarray_type_napi_biguint64_array: napi_typedarray_type = 10;
pub type napi_typedarray_type = ::std::os::raw::c_uint;
pub const napi_status_napi_ok: napi_status = 0;
pub const napi_status_napi_invalid_arg: napi_status = 1;
pub const napi_status_napi_object_expected: napi_status = 2;
pub const napi_status_napi_string_expected: napi_status = 3;
pub const napi_status_napi_name_expected: napi_status = 4;
pub const napi_status_napi_function_expected: napi_status = 5;
pub const napi_status_napi_number_expected: napi_status = 6;
pub const napi_status_napi_boolean_expected: napi_status = 7;
pub const napi_status_napi_array_expected: napi_status = 8;
pub const napi_status_napi_generic_failure: napi_status = 9;
pub const napi_status_napi_pending_exception: napi_status = 10;
pub const napi_status_napi_cancelled: napi_status = 11;
pub const napi_status_napi_escape_called_twice: napi_status = 12;
pub const napi_status_napi_handle_scope_mismatch: napi_status = 13;
pub const napi_status_napi_callback_scope_mismatch: napi_status = 14;
pub const napi_status_napi_queue_full: napi_status = 15;
pub const napi_status_napi_closing: napi_status = 16;
pub const napi_status_napi_bigint_expected: napi_status = 17;
pub const napi_status_napi_date_expected: napi_status = 18;
pub const napi_status_napi_arraybuffer_expected: napi_status = 19;
pub const napi_status_napi_detachable_arraybuffer_expected: napi_status = 20;
pub const napi_status_napi_would_deadlock: napi_status = 21;
pub const napi_status_napi_create_ark_runtime_too_many_envs: napi_status = 22;
pub const napi_status_napi_create_ark_runtime_only_one_env_per_thread: napi_status = 23;
pub const napi_status_napi_destroy_ark_runtime_env_not_exist: napi_status = 24;
pub type napi_status = ::std::os::raw::c_uint;
pub type napi_callback = ::std::option::Option<
    unsafe extern "C" fn(env: napi_env, info: napi_callback_info) -> napi_value,
>;
pub type napi_finalize = ::std::option::Option<
    unsafe extern "C" fn(
        env: napi_env,
        finalize_data: *mut ::std::os::raw::c_void,
        finalize_hint: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_property_descriptor {
    pub utf8name: *const ::std::os::raw::c_char,
    pub name: napi_value,
    pub method: napi_callback,
    pub getter: napi_callback,
    pub setter: napi_callback,
    pub value: napi_value,
    pub attributes: napi_property_attributes,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of napi_property_descriptor"]
        [::std::mem::size_of::<napi_property_descriptor>() - 64usize];
    ["Alignment of napi_property_descriptor"]
        [::std::mem::align_of::<napi_property_descriptor>() - 8usize];
    ["Offset of field: napi_property_descriptor::utf8name"]
        [::std::mem::offset_of!(napi_property_descriptor, utf8name) - 0usize];
    ["Offset of field: napi_property_descriptor::name"]
        [::std::mem::offset_of!(napi_property_descriptor, name) - 8usize];
    ["Offset of field: napi_property_descriptor::method"]
        [::std::mem::offset_of!(napi_property_descriptor, method) - 16usize];
    ["Offset of field: napi_property_descriptor::getter"]
        [::std::mem::offset_of!(napi_property_descriptor, getter) - 24usize];
    ["Offset of field: napi_property_descriptor::setter"]
        [::std::mem::offset_of!(napi_property_descriptor, setter) - 32usize];
    ["Offset of field: napi_property_descriptor::value"]
        [::std::mem::offset_of!(napi_property_descriptor, value) - 40usize];
    ["Offset of field: napi_property_descriptor::attributes"]
        [::std::mem::offset_of!(napi_property_descriptor, attributes) - 48usize];
    ["Offset of field: napi_property_descriptor::data"]
        [::std::mem::offset_of!(napi_property_descriptor, data) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_extended_error_info {
    pub error_message: *const ::std::os::raw::c_char,
    pub engine_reserved: *mut ::std::os::raw::c_void,
    pub engine_error_code: u32,
    pub error_code: napi_status,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of napi_extended_error_info"]
        [::std::mem::size_of::<napi_extended_error_info>() - 24usize];
    ["Alignment of napi_extended_error_info"]
        [::std::mem::align_of::<napi_extended_error_info>() - 8usize];
    ["Offset of field: napi_extended_error_info::error_message"]
        [::std::mem::offset_of!(napi_extended_error_info, error_message) - 0usize];
    ["Offset of field: napi_extended_error_info::engine_reserved"]
        [::std::mem::offset_of!(napi_extended_error_info, engine_reserved) - 8usize];
    ["Offset of field: napi_extended_error_info::engine_error_code"]
        [::std::mem::offset_of!(napi_extended_error_info, engine_error_code) - 16usize];
    ["Offset of field: napi_extended_error_info::error_code"]
        [::std::mem::offset_of!(napi_extended_error_info, error_code) - 20usize];
};
pub const napi_key_collection_mode_napi_key_include_prototypes: napi_key_collection_mode = 0;
pub const napi_key_collection_mode_napi_key_own_only: napi_key_collection_mode = 1;
pub type napi_key_collection_mode = ::std::os::raw::c_uint;
pub const napi_key_filter_napi_key_all_properties: napi_key_filter = 0;
pub const napi_key_filter_napi_key_writable: napi_key_filter = 1;
pub const napi_key_filter_napi_key_enumerable: napi_key_filter = 2;
pub const napi_key_filter_napi_key_configurable: napi_key_filter = 4;
pub const napi_key_filter_napi_key_skip_strings: napi_key_filter = 8;
pub const napi_key_filter_napi_key_skip_symbols: napi_key_filter = 16;
pub type napi_key_filter = ::std::os::raw::c_uint;
pub const napi_key_conversion_napi_key_keep_numbers: napi_key_conversion = 0;
pub const napi_key_conversion_napi_key_numbers_to_strings: napi_key_conversion = 1;
pub type napi_key_conversion = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_type_tag {
    pub lower: u64,
    pub upper: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of napi_type_tag"][::std::mem::size_of::<napi_type_tag>() - 16usize];
    ["Alignment of napi_type_tag"][::std::mem::align_of::<napi_type_tag>() - 8usize];
    ["Offset of field: napi_type_tag::lower"]
        [::std::mem::offset_of!(napi_type_tag, lower) - 0usize];
    ["Offset of field: napi_type_tag::upper"]
        [::std::mem::offset_of!(napi_type_tag, upper) - 8usize];
};
extern "C" {
    pub fn napi_get_last_error_info(
        env: napi_env,
        result: *mut *const napi_extended_error_info,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_undefined(env: napi_env, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_get_null(env: napi_env, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_get_global(env: napi_env, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_get_boolean(env: napi_env, value: bool, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_object(env: napi_env, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_array(env: napi_env, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_array_with_length(
        env: napi_env,
        length: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_double(env: napi_env, value: f64, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_int32(env: napi_env, value: i32, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_uint32(env: napi_env, value: u32, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_int64(env: napi_env, value: i64, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_string_latin1(
        env: napi_env,
        str_: *const ::std::os::raw::c_char,
        length: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_string_utf8(
        env: napi_env,
        str_: *const ::std::os::raw::c_char,
        length: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_string_utf16(
        env: napi_env,
        str_: *const char16_t,
        length: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_symbol(
        env: napi_env,
        description: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_function(
        env: napi_env,
        utf8name: *const ::std::os::raw::c_char,
        length: usize,
        cb: napi_callback,
        data: *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_error(
        env: napi_env,
        code: napi_value,
        msg: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_type_error(
        env: napi_env,
        code: napi_value,
        msg: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_range_error(
        env: napi_env,
        code: napi_value,
        msg: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_typeof(
        env: napi_env,
        value: napi_value,
        result: *mut napi_valuetype,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_double(env: napi_env, value: napi_value, result: *mut f64)
        -> napi_status;
}
extern "C" {
    pub fn napi_get_value_int32(env: napi_env, value: napi_value, result: *mut i32) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_uint32(env: napi_env, value: napi_value, result: *mut u32)
        -> napi_status;
}
extern "C" {
    pub fn napi_get_value_int64(env: napi_env, value: napi_value, result: *mut i64) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_bool(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_string_latin1(
        env: napi_env,
        value: napi_value,
        buf: *mut ::std::os::raw::c_char,
        bufsize: usize,
        result: *mut usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_string_utf8(
        env: napi_env,
        value: napi_value,
        buf: *mut ::std::os::raw::c_char,
        bufsize: usize,
        result: *mut usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_string_utf16(
        env: napi_env,
        value: napi_value,
        buf: *mut char16_t,
        bufsize: usize,
        result: *mut usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_coerce_to_bool(
        env: napi_env,
        value: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_coerce_to_number(
        env: napi_env,
        value: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_coerce_to_object(
        env: napi_env,
        value: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_coerce_to_string(
        env: napi_env,
        value: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_prototype(
        env: napi_env,
        object: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_property_names(
        env: napi_env,
        object: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_set_property(
        env: napi_env,
        object: napi_value,
        key: napi_value,
        value: napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_has_property(
        env: napi_env,
        object: napi_value,
        key: napi_value,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_property(
        env: napi_env,
        object: napi_value,
        key: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_delete_property(
        env: napi_env,
        object: napi_value,
        key: napi_value,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_has_own_property(
        env: napi_env,
        object: napi_value,
        key: napi_value,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_set_named_property(
        env: napi_env,
        object: napi_value,
        utf8name: *const ::std::os::raw::c_char,
        value: napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_has_named_property(
        env: napi_env,
        object: napi_value,
        utf8name: *const ::std::os::raw::c_char,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_named_property(
        env: napi_env,
        object: napi_value,
        utf8name: *const ::std::os::raw::c_char,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_set_element(
        env: napi_env,
        object: napi_value,
        index: u32,
        value: napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_has_element(
        env: napi_env,
        object: napi_value,
        index: u32,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_element(
        env: napi_env,
        object: napi_value,
        index: u32,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_delete_element(
        env: napi_env,
        object: napi_value,
        index: u32,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_define_properties(
        env: napi_env,
        object: napi_value,
        property_count: usize,
        properties: *const napi_property_descriptor,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_is_array(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_get_array_length(env: napi_env, value: napi_value, result: *mut u32)
        -> napi_status;
}
extern "C" {
    pub fn napi_strict_equals(
        env: napi_env,
        lhs: napi_value,
        rhs: napi_value,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_call_function(
        env: napi_env,
        recv: napi_value,
        func: napi_value,
        argc: usize,
        argv: *const napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_new_instance(
        env: napi_env,
        constructor: napi_value,
        argc: usize,
        argv: *const napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_instanceof(
        env: napi_env,
        object: napi_value,
        constructor: napi_value,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_cb_info(
        env: napi_env,
        cbinfo: napi_callback_info,
        argc: *mut usize,
        argv: *mut napi_value,
        this_arg: *mut napi_value,
        data: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_new_target(
        env: napi_env,
        cbinfo: napi_callback_info,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_define_class(
        env: napi_env,
        utf8name: *const ::std::os::raw::c_char,
        length: usize,
        constructor: napi_callback,
        data: *mut ::std::os::raw::c_void,
        property_count: usize,
        properties: *const napi_property_descriptor,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_wrap(
        env: napi_env,
        js_object: napi_value,
        native_object: *mut ::std::os::raw::c_void,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
        result: *mut napi_ref,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_unwrap(
        env: napi_env,
        js_object: napi_value,
        result: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_remove_wrap(
        env: napi_env,
        js_object: napi_value,
        result: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_external(
        env: napi_env,
        data: *mut ::std::os::raw::c_void,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_external(
        env: napi_env,
        value: napi_value,
        result: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_reference(
        env: napi_env,
        value: napi_value,
        initial_refcount: u32,
        result: *mut napi_ref,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_delete_reference(env: napi_env, ref_: napi_ref) -> napi_status;
}
extern "C" {
    pub fn napi_reference_ref(env: napi_env, ref_: napi_ref, result: *mut u32) -> napi_status;
}
extern "C" {
    pub fn napi_reference_unref(env: napi_env, ref_: napi_ref, result: *mut u32) -> napi_status;
}
extern "C" {
    pub fn napi_get_reference_value(
        env: napi_env,
        ref_: napi_ref,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_open_handle_scope(env: napi_env, result: *mut napi_handle_scope) -> napi_status;
}
extern "C" {
    pub fn napi_close_handle_scope(env: napi_env, scope: napi_handle_scope) -> napi_status;
}
extern "C" {
    pub fn napi_open_escapable_handle_scope(
        env: napi_env,
        result: *mut napi_escapable_handle_scope,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_close_escapable_handle_scope(
        env: napi_env,
        scope: napi_escapable_handle_scope,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_escape_handle(
        env: napi_env,
        scope: napi_escapable_handle_scope,
        escapee: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_throw(env: napi_env, error: napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_throw_error(
        env: napi_env,
        code: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_throw_type_error(
        env: napi_env,
        code: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_throw_range_error(
        env: napi_env,
        code: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_is_error(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_is_exception_pending(env: napi_env, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_get_and_clear_last_exception(env: napi_env, result: *mut napi_value)
        -> napi_status;
}
extern "C" {
    pub fn napi_is_arraybuffer(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_create_arraybuffer(
        env: napi_env,
        byte_length: usize,
        data: *mut *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_external_arraybuffer(
        env: napi_env,
        external_data: *mut ::std::os::raw::c_void,
        byte_length: usize,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_arraybuffer_info(
        env: napi_env,
        arraybuffer: napi_value,
        data: *mut *mut ::std::os::raw::c_void,
        byte_length: *mut usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_is_typedarray(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_create_typedarray(
        env: napi_env,
        type_: napi_typedarray_type,
        length: usize,
        arraybuffer: napi_value,
        byte_offset: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_typedarray_info(
        env: napi_env,
        typedarray: napi_value,
        type_: *mut napi_typedarray_type,
        length: *mut usize,
        data: *mut *mut ::std::os::raw::c_void,
        arraybuffer: *mut napi_value,
        byte_offset: *mut usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_dataview(
        env: napi_env,
        length: usize,
        arraybuffer: napi_value,
        byte_offset: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_is_dataview(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_get_dataview_info(
        env: napi_env,
        dataview: napi_value,
        bytelength: *mut usize,
        data: *mut *mut ::std::os::raw::c_void,
        arraybuffer: *mut napi_value,
        byte_offset: *mut usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_version(env: napi_env, result: *mut u32) -> napi_status;
}
extern "C" {
    pub fn napi_create_promise(
        env: napi_env,
        deferred: *mut napi_deferred,
        promise: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_resolve_deferred(
        env: napi_env,
        deferred: napi_deferred,
        resolution: napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_reject_deferred(
        env: napi_env,
        deferred: napi_deferred,
        rejection: napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_is_promise(env: napi_env, value: napi_value, is_promise: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_run_script(
        env: napi_env,
        script: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_adjust_external_memory(
        env: napi_env,
        change_in_bytes: i64,
        adjusted_value: *mut i64,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_date(env: napi_env, time: f64, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_is_date(env: napi_env, value: napi_value, is_date: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_get_date_value(env: napi_env, value: napi_value, result: *mut f64) -> napi_status;
}
extern "C" {
    pub fn napi_add_finalizer(
        env: napi_env,
        js_object: napi_value,
        native_object: *mut ::std::os::raw::c_void,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
        result: *mut napi_ref,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_bigint_int64(
        env: napi_env,
        value: i64,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_bigint_uint64(
        env: napi_env,
        value: u64,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_bigint_words(
        env: napi_env,
        sign_bit: ::std::os::raw::c_int,
        word_count: usize,
        words: *const u64,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_bigint_int64(
        env: napi_env,
        value: napi_value,
        result: *mut i64,
        lossless: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_bigint_uint64(
        env: napi_env,
        value: napi_value,
        result: *mut u64,
        lossless: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_value_bigint_words(
        env: napi_env,
        value: napi_value,
        sign_bit: *mut ::std::os::raw::c_int,
        word_count: *mut usize,
        words: *mut u64,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_all_property_names(
        env: napi_env,
        object: napi_value,
        key_mode: napi_key_collection_mode,
        key_filter: napi_key_filter,
        key_conversion: napi_key_conversion,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_set_instance_data(
        env: napi_env,
        data: *mut ::std::os::raw::c_void,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_instance_data(
        env: napi_env,
        data: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_detach_arraybuffer(env: napi_env, arraybuffer: napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_is_detached_arraybuffer(
        env: napi_env,
        value: napi_value,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_type_tag_object(
        env: napi_env,
        value: napi_value,
        type_tag: *const napi_type_tag,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_check_object_type_tag(
        env: napi_env,
        value: napi_value,
        type_tag: *const napi_type_tag,
        result: *mut bool,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_object_freeze(env: napi_env, object: napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_object_seal(env: napi_env, object: napi_value) -> napi_status;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_callback_scope__ {
    _unused: [u8; 0],
}
pub type napi_callback_scope = *mut napi_callback_scope__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_async_context__ {
    _unused: [u8; 0],
}
pub type napi_async_context = *mut napi_async_context__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_async_work__ {
    _unused: [u8; 0],
}
pub type napi_async_work = *mut napi_async_work__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_threadsafe_function__ {
    _unused: [u8; 0],
}
pub type napi_threadsafe_function = *mut napi_threadsafe_function__;
pub const napi_threadsafe_function_release_mode_napi_tsfn_release:
    napi_threadsafe_function_release_mode = 0;
pub const napi_threadsafe_function_release_mode_napi_tsfn_abort:
    napi_threadsafe_function_release_mode = 1;
pub type napi_threadsafe_function_release_mode = ::std::os::raw::c_uint;
pub const napi_threadsafe_function_call_mode_napi_tsfn_nonblocking:
    napi_threadsafe_function_call_mode = 0;
pub const napi_threadsafe_function_call_mode_napi_tsfn_blocking:
    napi_threadsafe_function_call_mode = 1;
pub type napi_threadsafe_function_call_mode = ::std::os::raw::c_uint;
pub type napi_async_execute_callback =
    ::std::option::Option<unsafe extern "C" fn(env: napi_env, data: *mut ::std::os::raw::c_void)>;
pub type napi_async_complete_callback = ::std::option::Option<
    unsafe extern "C" fn(env: napi_env, status: napi_status, data: *mut ::std::os::raw::c_void),
>;
pub type napi_threadsafe_function_call_js = ::std::option::Option<
    unsafe extern "C" fn(
        env: napi_env,
        js_callback: napi_value,
        context: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_node_version {
    pub major: u32,
    pub minor: u32,
    pub patch: u32,
    pub release: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of napi_node_version"][::std::mem::size_of::<napi_node_version>() - 24usize];
    ["Alignment of napi_node_version"][::std::mem::align_of::<napi_node_version>() - 8usize];
    ["Offset of field: napi_node_version::major"]
        [::std::mem::offset_of!(napi_node_version, major) - 0usize];
    ["Offset of field: napi_node_version::minor"]
        [::std::mem::offset_of!(napi_node_version, minor) - 4usize];
    ["Offset of field: napi_node_version::patch"]
        [::std::mem::offset_of!(napi_node_version, patch) - 8usize];
    ["Offset of field: napi_node_version::release"]
        [::std::mem::offset_of!(napi_node_version, release) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_async_cleanup_hook_handle__ {
    _unused: [u8; 0],
}
pub type napi_async_cleanup_hook_handle = *mut napi_async_cleanup_hook_handle__;
pub type napi_async_cleanup_hook = ::std::option::Option<
    unsafe extern "C" fn(handle: napi_async_cleanup_hook_handle, data: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uv_loop_s {
    _unused: [u8; 0],
}
pub type napi_addon_register_func =
    ::std::option::Option<unsafe extern "C" fn(env: napi_env, exports: napi_value) -> napi_value>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct napi_module {
    pub nm_version: ::std::os::raw::c_int,
    pub nm_flags: ::std::os::raw::c_uint,
    pub nm_filename: *const ::std::os::raw::c_char,
    pub nm_register_func: napi_addon_register_func,
    pub nm_modname: *const ::std::os::raw::c_char,
    pub nm_priv: *mut ::std::os::raw::c_void,
    pub reserved: [*mut ::std::os::raw::c_void; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of napi_module"][::std::mem::size_of::<napi_module>() - 72usize];
    ["Alignment of napi_module"][::std::mem::align_of::<napi_module>() - 8usize];
    ["Offset of field: napi_module::nm_version"]
        [::std::mem::offset_of!(napi_module, nm_version) - 0usize];
    ["Offset of field: napi_module::nm_flags"]
        [::std::mem::offset_of!(napi_module, nm_flags) - 4usize];
    ["Offset of field: napi_module::nm_filename"]
        [::std::mem::offset_of!(napi_module, nm_filename) - 8usize];
    ["Offset of field: napi_module::nm_register_func"]
        [::std::mem::offset_of!(napi_module, nm_register_func) - 16usize];
    ["Offset of field: napi_module::nm_modname"]
        [::std::mem::offset_of!(napi_module, nm_modname) - 24usize];
    ["Offset of field: napi_module::nm_priv"]
        [::std::mem::offset_of!(napi_module, nm_priv) - 32usize];
    ["Offset of field: napi_module::reserved"]
        [::std::mem::offset_of!(napi_module, reserved) - 40usize];
};
extern "C" {
    pub fn napi_module_register(mod_: *mut napi_module);
}
extern "C" {
    pub fn napi_fatal_error(
        location: *const ::std::os::raw::c_char,
        location_len: usize,
        message: *const ::std::os::raw::c_char,
        message_len: usize,
    ) -> !;
}
extern "C" {
    pub fn napi_async_init(
        env: napi_env,
        async_resource: napi_value,
        async_resource_name: napi_value,
        result: *mut napi_async_context,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_async_destroy(env: napi_env, async_context: napi_async_context) -> napi_status;
}
extern "C" {
    pub fn napi_make_callback(
        env: napi_env,
        async_context: napi_async_context,
        recv: napi_value,
        func: napi_value,
        argc: usize,
        argv: *const napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_buffer(
        env: napi_env,
        length: usize,
        data: *mut *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_external_buffer(
        env: napi_env,
        length: usize,
        data: *mut ::std::os::raw::c_void,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_buffer_copy(
        env: napi_env,
        length: usize,
        data: *const ::std::os::raw::c_void,
        result_data: *mut *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_is_buffer(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_get_buffer_info(
        env: napi_env,
        value: napi_value,
        data: *mut *mut ::std::os::raw::c_void,
        length: *mut usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_async_work(
        env: napi_env,
        async_resource: napi_value,
        async_resource_name: napi_value,
        execute: napi_async_execute_callback,
        complete: napi_async_complete_callback,
        data: *mut ::std::os::raw::c_void,
        result: *mut napi_async_work,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_delete_async_work(env: napi_env, work: napi_async_work) -> napi_status;
}
extern "C" {
    pub fn napi_queue_async_work(env: napi_env, work: napi_async_work) -> napi_status;
}
extern "C" {
    pub fn napi_cancel_async_work(env: napi_env, work: napi_async_work) -> napi_status;
}
extern "C" {
    pub fn napi_get_node_version(
        env: napi_env,
        version: *mut *const napi_node_version,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_uv_event_loop(env: napi_env, loop_: *mut *mut uv_loop_s) -> napi_status;
}
extern "C" {
    pub fn napi_fatal_exception(env: napi_env, err: napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_add_env_cleanup_hook(
        env: napi_env,
        fun: ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>,
        arg: *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_remove_env_cleanup_hook(
        env: napi_env,
        fun: ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>,
        arg: *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_open_callback_scope(
        env: napi_env,
        resource_object: napi_value,
        context: napi_async_context,
        result: *mut napi_callback_scope,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_close_callback_scope(env: napi_env, scope: napi_callback_scope) -> napi_status;
}
extern "C" {
    pub fn napi_create_threadsafe_function(
        env: napi_env,
        func: napi_value,
        async_resource: napi_value,
        async_resource_name: napi_value,
        max_queue_size: usize,
        initial_thread_count: usize,
        thread_finalize_data: *mut ::std::os::raw::c_void,
        thread_finalize_cb: napi_finalize,
        context: *mut ::std::os::raw::c_void,
        call_js_cb: napi_threadsafe_function_call_js,
        result: *mut napi_threadsafe_function,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_get_threadsafe_function_context(
        func: napi_threadsafe_function,
        result: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_call_threadsafe_function(
        func: napi_threadsafe_function,
        data: *mut ::std::os::raw::c_void,
        is_blocking: napi_threadsafe_function_call_mode,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_acquire_threadsafe_function(func: napi_threadsafe_function) -> napi_status;
}
extern "C" {
    pub fn napi_release_threadsafe_function(
        func: napi_threadsafe_function,
        mode: napi_threadsafe_function_release_mode,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_unref_threadsafe_function(
        env: napi_env,
        func: napi_threadsafe_function,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_ref_threadsafe_function(
        env: napi_env,
        func: napi_threadsafe_function,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_add_async_cleanup_hook(
        env: napi_env,
        hook: napi_async_cleanup_hook,
        arg: *mut ::std::os::raw::c_void,
        remove_handle: *mut napi_async_cleanup_hook_handle,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_remove_async_cleanup_hook(
        remove_handle: napi_async_cleanup_hook_handle,
    ) -> napi_status;
}
extern "C" {
    pub fn node_api_get_module_file_name(
        env: napi_env,
        result: *mut *const ::std::os::raw::c_char,
    ) -> napi_status;
}
pub type napi_native_binding_detach_callback = ::std::option::Option<
    unsafe extern "C" fn(
        env: napi_env,
        native_object: *mut ::std::os::raw::c_void,
        hint: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type napi_native_binding_attach_callback = ::std::option::Option<
    unsafe extern "C" fn(
        env: napi_env,
        native_object: *mut ::std::os::raw::c_void,
        hint: *mut ::std::os::raw::c_void,
    ) -> napi_value,
>;
extern "C" {
    pub fn napi_run_script_path(
        env: napi_env,
        path: *const ::std::os::raw::c_char,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_queue_async_work_with_qos(
        env: napi_env,
        work: napi_async_work,
        qos: napi_qos_t,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_load_module(
        env: napi_env,
        path: *const ::std::os::raw::c_char,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_load_module_with_info(
        env: napi_env,
        path: *const ::std::os::raw::c_char,
        module_info: *const ::std::os::raw::c_char,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_object_with_properties(
        env: napi_env,
        result: *mut napi_value,
        property_count: usize,
        properties: *const napi_property_descriptor,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_object_with_named_properties(
        env: napi_env,
        result: *mut napi_value,
        property_count: usize,
        keys: *mut *const ::std::os::raw::c_char,
        values: *const napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_coerce_to_native_binding_object(
        env: napi_env,
        js_object: napi_value,
        detach_cb: napi_native_binding_detach_callback,
        attach_cb: napi_native_binding_attach_callback,
        native_object: *mut ::std::os::raw::c_void,
        hint: *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_ark_runtime(env: *mut napi_env) -> napi_status;
}
extern "C" {
    pub fn napi_destroy_ark_runtime(env: *mut napi_env) -> napi_status;
}
extern "C" {
    pub fn napi_define_sendable_class(
        env: napi_env,
        utf8name: *const ::std::os::raw::c_char,
        length: usize,
        constructor: napi_callback,
        data: *mut ::std::os::raw::c_void,
        property_count: usize,
        properties: *const napi_property_descriptor,
        parent: napi_value,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_is_sendable(env: napi_env, value: napi_value, result: *mut bool) -> napi_status;
}
extern "C" {
    pub fn napi_create_sendable_object_with_properties(
        env: napi_env,
        property_count: usize,
        properties: *const napi_property_descriptor,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_wrap_sendable(
        env: napi_env,
        js_object: napi_value,
        native_object: *mut ::std::os::raw::c_void,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_wrap_sendable_with_size(
        env: napi_env,
        js_object: napi_value,
        native_object: *mut ::std::os::raw::c_void,
        finalize_cb: napi_finalize,
        finalize_hint: *mut ::std::os::raw::c_void,
        native_binding_size: usize,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_unwrap_sendable(
        env: napi_env,
        js_object: napi_value,
        result: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_remove_wrap_sendable(
        env: napi_env,
        js_object: napi_value,
        result: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_sendable_array(env: napi_env, result: *mut napi_value) -> napi_status;
}
extern "C" {
    pub fn napi_create_sendable_array_with_length(
        env: napi_env,
        length: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_sendable_arraybuffer(
        env: napi_env,
        byte_length: usize,
        data: *mut *mut ::std::os::raw::c_void,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_create_sendable_typedarray(
        env: napi_env,
        type_: napi_typedarray_type,
        length: usize,
        arraybuffer: napi_value,
        byte_offset: usize,
        result: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_run_event_loop(env: napi_env, mode: napi_event_mode) -> napi_status;
}
extern "C" {
    pub fn napi_stop_event_loop(env: napi_env) -> napi_status;
}
extern "C" {
    pub fn napi_serialize(
        env: napi_env,
        object: napi_value,
        transfer_list: napi_value,
        clone_list: napi_value,
        result: *mut *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_deserialize(
        env: napi_env,
        buffer: *mut ::std::os::raw::c_void,
        object: *mut napi_value,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_delete_serialization_data(
        env: napi_env,
        buffer: *mut ::std::os::raw::c_void,
    ) -> napi_status;
}
extern "C" {
    pub fn napi_call_threadsafe_function_with_priority(
        func: napi_threadsafe_function,
        data: *mut ::std::os::raw::c_void,
        priority: napi_task_priority,
        isTail: bool,
    ) -> napi_status;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_PixelmapNative {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_NativeBuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_NativeColorSpaceManager {
    _unused: [u8; 0],
}
pub const PIXELMAP_ALPHA_TYPE_PIXELMAP_ALPHA_TYPE_UNKNOWN: PIXELMAP_ALPHA_TYPE = 0;
pub const PIXELMAP_ALPHA_TYPE_PIXELMAP_ALPHA_TYPE_OPAQUE: PIXELMAP_ALPHA_TYPE = 1;
pub const PIXELMAP_ALPHA_TYPE_PIXELMAP_ALPHA_TYPE_PREMULTIPLIED: PIXELMAP_ALPHA_TYPE = 2;
pub const PIXELMAP_ALPHA_TYPE_PIXELMAP_ALPHA_TYPE_UNPREMULTIPLIED: PIXELMAP_ALPHA_TYPE = 3;
pub type PIXELMAP_ALPHA_TYPE = ::std::os::raw::c_uint;
pub const PIXEL_FORMAT_PIXEL_FORMAT_UNKNOWN: PIXEL_FORMAT = 0;
pub const PIXEL_FORMAT_PIXEL_FORMAT_RGB_565: PIXEL_FORMAT = 2;
pub const PIXEL_FORMAT_PIXEL_FORMAT_RGBA_8888: PIXEL_FORMAT = 3;
pub const PIXEL_FORMAT_PIXEL_FORMAT_BGRA_8888: PIXEL_FORMAT = 4;
pub const PIXEL_FORMAT_PIXEL_FORMAT_RGB_888: PIXEL_FORMAT = 5;
pub const PIXEL_FORMAT_PIXEL_FORMAT_ALPHA_8: PIXEL_FORMAT = 6;
pub const PIXEL_FORMAT_PIXEL_FORMAT_RGBA_F16: PIXEL_FORMAT = 7;
pub const PIXEL_FORMAT_PIXEL_FORMAT_NV21: PIXEL_FORMAT = 8;
pub const PIXEL_FORMAT_PIXEL_FORMAT_NV12: PIXEL_FORMAT = 9;
pub const PIXEL_FORMAT_PIXEL_FORMAT_RGBA_1010102: PIXEL_FORMAT = 10;
pub const PIXEL_FORMAT_PIXEL_FORMAT_YCBCR_P010: PIXEL_FORMAT = 11;
pub const PIXEL_FORMAT_PIXEL_FORMAT_YCRCB_P010: PIXEL_FORMAT = 12;
pub type PIXEL_FORMAT = ::std::os::raw::c_uint;
pub const OH_PixelmapNative_AntiAliasingLevel_OH_PixelmapNative_AntiAliasing_NONE:
    OH_PixelmapNative_AntiAliasingLevel = 0;
pub const OH_PixelmapNative_AntiAliasingLevel_OH_PixelmapNative_AntiAliasing_LOW:
    OH_PixelmapNative_AntiAliasingLevel = 1;
pub const OH_PixelmapNative_AntiAliasingLevel_OH_PixelmapNative_AntiAliasing_MEDIUM:
    OH_PixelmapNative_AntiAliasingLevel = 2;
pub const OH_PixelmapNative_AntiAliasingLevel_OH_PixelmapNative_AntiAliasing_HIGH:
    OH_PixelmapNative_AntiAliasingLevel = 3;
pub type OH_PixelmapNative_AntiAliasingLevel = ::std::os::raw::c_uint;
pub const OH_Pixelmap_HdrMetadataKey_HDR_METADATA_TYPE: OH_Pixelmap_HdrMetadataKey = 0;
pub const OH_Pixelmap_HdrMetadataKey_HDR_STATIC_METADATA: OH_Pixelmap_HdrMetadataKey = 1;
pub const OH_Pixelmap_HdrMetadataKey_HDR_DYNAMIC_METADATA: OH_Pixelmap_HdrMetadataKey = 2;
pub const OH_Pixelmap_HdrMetadataKey_HDR_GAINMAP_METADATA: OH_Pixelmap_HdrMetadataKey = 3;
pub type OH_Pixelmap_HdrMetadataKey = ::std::os::raw::c_uint;
pub const OH_Pixelmap_HdrMetadataType_HDR_METADATA_TYPE_NONE: OH_Pixelmap_HdrMetadataType = 0;
pub const OH_Pixelmap_HdrMetadataType_HDR_METADATA_TYPE_BASE: OH_Pixelmap_HdrMetadataType = 1;
pub const OH_Pixelmap_HdrMetadataType_HDR_METADATA_TYPE_GAINMAP: OH_Pixelmap_HdrMetadataType = 2;
pub const OH_Pixelmap_HdrMetadataType_HDR_METADATA_TYPE_ALTERNATE: OH_Pixelmap_HdrMetadataType = 3;
pub type OH_Pixelmap_HdrMetadataType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_Pixelmap_HdrStaticMetadata {
    pub displayPrimariesX: [f32; 3usize],
    pub displayPrimariesY: [f32; 3usize],
    pub whitePointX: f32,
    pub whitePointY: f32,
    pub maxLuminance: f32,
    pub minLuminance: f32,
    pub maxContentLightLevel: f32,
    pub maxFrameAverageLightLevel: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OH_Pixelmap_HdrStaticMetadata"]
        [::std::mem::size_of::<OH_Pixelmap_HdrStaticMetadata>() - 48usize];
    ["Alignment of OH_Pixelmap_HdrStaticMetadata"]
        [::std::mem::align_of::<OH_Pixelmap_HdrStaticMetadata>() - 4usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::displayPrimariesX"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrStaticMetadata, displayPrimariesX) - 0usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::displayPrimariesY"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrStaticMetadata, displayPrimariesY) - 12usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::whitePointX"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrStaticMetadata, whitePointX) - 24usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::whitePointY"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrStaticMetadata, whitePointY) - 28usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::maxLuminance"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrStaticMetadata, maxLuminance) - 32usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::minLuminance"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrStaticMetadata, minLuminance) - 36usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::maxContentLightLevel"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrStaticMetadata, maxContentLightLevel) - 40usize];
    ["Offset of field: OH_Pixelmap_HdrStaticMetadata::maxFrameAverageLightLevel"][::std::mem::offset_of!(
        OH_Pixelmap_HdrStaticMetadata,
        maxFrameAverageLightLevel
    ) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_Pixelmap_HdrDynamicMetadata {
    pub data: *mut u8,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OH_Pixelmap_HdrDynamicMetadata"]
        [::std::mem::size_of::<OH_Pixelmap_HdrDynamicMetadata>() - 16usize];
    ["Alignment of OH_Pixelmap_HdrDynamicMetadata"]
        [::std::mem::align_of::<OH_Pixelmap_HdrDynamicMetadata>() - 8usize];
    ["Offset of field: OH_Pixelmap_HdrDynamicMetadata::data"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrDynamicMetadata, data) - 0usize];
    ["Offset of field: OH_Pixelmap_HdrDynamicMetadata::length"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrDynamicMetadata, length) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_Pixelmap_HdrGainmapMetadata {
    pub writerVersion: u16,
    pub miniVersion: u16,
    pub gainmapChannelNum: u8,
    pub useBaseColorFlag: bool,
    pub baseHeadroom: f32,
    pub alternateHeadroom: f32,
    pub gainmapMax: [f32; 3usize],
    pub gainmapMin: [f32; 3usize],
    pub gamma: [f32; 3usize],
    pub baselineOffset: [f32; 3usize],
    pub alternateOffset: [f32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OH_Pixelmap_HdrGainmapMetadata"]
        [::std::mem::size_of::<OH_Pixelmap_HdrGainmapMetadata>() - 76usize];
    ["Alignment of OH_Pixelmap_HdrGainmapMetadata"]
        [::std::mem::align_of::<OH_Pixelmap_HdrGainmapMetadata>() - 4usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::writerVersion"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, writerVersion) - 0usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::miniVersion"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, miniVersion) - 2usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::gainmapChannelNum"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, gainmapChannelNum) - 4usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::useBaseColorFlag"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, useBaseColorFlag) - 5usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::baseHeadroom"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, baseHeadroom) - 8usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::alternateHeadroom"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, alternateHeadroom) - 12usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::gainmapMax"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, gainmapMax) - 16usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::gainmapMin"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, gainmapMin) - 28usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::gamma"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, gamma) - 40usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::baselineOffset"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, baselineOffset) - 52usize];
    ["Offset of field: OH_Pixelmap_HdrGainmapMetadata::alternateOffset"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrGainmapMetadata, alternateOffset) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_Pixelmap_HdrMetadataValue {
    pub type_: OH_Pixelmap_HdrMetadataType,
    pub staticMetadata: OH_Pixelmap_HdrStaticMetadata,
    pub dynamicMetadata: OH_Pixelmap_HdrDynamicMetadata,
    pub gainmapMetadata: OH_Pixelmap_HdrGainmapMetadata,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OH_Pixelmap_HdrMetadataValue"]
        [::std::mem::size_of::<OH_Pixelmap_HdrMetadataValue>() - 152usize];
    ["Alignment of OH_Pixelmap_HdrMetadataValue"]
        [::std::mem::align_of::<OH_Pixelmap_HdrMetadataValue>() - 8usize];
    ["Offset of field: OH_Pixelmap_HdrMetadataValue::type_"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrMetadataValue, type_) - 0usize];
    ["Offset of field: OH_Pixelmap_HdrMetadataValue::staticMetadata"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrMetadataValue, staticMetadata) - 4usize];
    ["Offset of field: OH_Pixelmap_HdrMetadataValue::dynamicMetadata"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrMetadataValue, dynamicMetadata) - 56usize];
    ["Offset of field: OH_Pixelmap_HdrMetadataValue::gainmapMetadata"]
        [::std::mem::offset_of!(OH_Pixelmap_HdrMetadataValue, gainmapMetadata) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OH_Pixelmap_InitializationOptions {
    _unused: [u8; 0],
}
extern "C" {
    pub fn OH_PixelmapInitializationOptions_Create(
        options: *mut *mut OH_Pixelmap_InitializationOptions,
    ) -> Image_ErrorCode;
}
extern "C" {
    pub fn OH_PixelmapInitializationOptions_GetWidth(
        options: *mut OH_Pixelmap_InitializationOptions,
        width: *mut u32,
    ) -> Image_ErrorCode;
}
extern "C" {
    pub fn OH_PixelmapInitializationOptions_SetWidth(
        options: *mut OH_Pixelmap_InitializationOptions,
        width: u32,
    ) -> Image_ErrorCode;
}
extern "C" {
    pub fn OH_PixelmapInitializationOptions_GetHeight(
        options: *mut OH_Pixelmap_InitializationOptions,
        height: *mut u32,
    ) -> Image_ErrorCode;
}
extern "C" {
